jxz1223/DC_BLE_Lockin/STM32_WPAN/App/app_ble.c
      /* USER CODE END HCI_TL_CmdAvailable */
      break;

    default:
      /* USER CODE BEGIN Status */

      /* USER CODE END Status */
      break;
  }

  return;
}

void SVCCTL_ResumeUserEventFlow(void)
{
  hci_resume_flow();

  return;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
static void BleLinkLed_StartBlink(void)
{
  BleLinkLedBlinkEnabled = 1U;
  BSP_LED_Off(LED_GREEN);

  if (BleLinkLedTimerReady != 0U)
  {
    HW_TS_Stop(BleLinkLedTimerId);
    HW_TS_Start(BleLinkLedTimerId, BleLinkLed_MsToTicks(BLE_LINK_LED_BLINK_MS));
  }
  else
  {
    /* A timer allocation failure is visible as a steady-off link LED. */
    APP_DBG_MSG("BLE link LED timer allocation failed\n\r");
  }
}

static void BleLinkLed_SetConnected(void)
{
  BleLinkLedBlinkEnabled = 0U;
  if (BleLinkLedTimerReady != 0U)
  {
    HW_TS_Stop(BleLinkLedTimerId);
  }
  BSP_LED_On(LED_GREEN);
}

static void BleLinkLed_Timeout(void)
{
  if (BleLinkLedBlinkEnabled != 0U)
  {
    BSP_LED_Toggle(LED_GREEN);
  }
  else
  {
    BSP_LED_On(LED_GREEN);
  }
}

static uint32_t BleLinkLed_MsToTicks(uint32_t timeout_ms)
{
  uint32_t timeout_ticks = ((timeout_ms * 1000U) + CFG_TS_TICK_VAL - 1U) /
                           CFG_TS_TICK_VAL;

  return (timeout_ticks == 0U) ? 1U : timeout_ticks;
}

static void LinkConfiguration(void)
{
  tBleStatus status;

  APP_DBG_MSG("set data length \n");
  status = hci_le_set_data_length(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,SizeTx_Char,2120);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("set data length command error \n");
  }

  /*
   * The multi-link relay is the GATT client and owns ATT MTU negotiation for
   * each connection.  Do not start a competing procedure from the peripheral,
   * and never wait for a completion event when command start may have failed.
   */
  return;
}
/* USER CODE END FD_WRAP_FUNCTIONS */
